cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
					</field>
				</fields>
			</register>
			<register>
				<dim>3</dim>
				<dimIncrement>0x4</dimIncrement>
				<dimIndex>1-3</dimIndex>
				<name>ADR%s</name>
				<description>I2C Slave Address Register. Contains the 7-bit slave address for operation of the I2C interface in slave mode, and is not used in master mode. The least significant bit determines whether a slave responds to the General Call address.</description>
				<addressOffset>0x020</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>GC</name>
						<description>General Call enable bit.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>Address</name>
						<description>The I2C device address for slave mode.</description>
						<bitRange>[7:1]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>DATA_BUFFER</name>
				<description>Data buffer register. The contents of the 8 MSBs of the I2DAT shift register will be transferred to the DATA_BUFFER automatically after every nine bits (8 bits of data plus ACK or NACK) has been received on the bus.</description>
				<addressOffset>0x02C</addressOffset>
				<access>read-only</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>Data</name>
						<description>This register holds contents of the 8 MSBs of the I2DAT shift register.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<dim>4</dim>
				<dimIncrement>0x4</dimIncrement>
				<dimIndex>0-3</dimIndex>
				<name>MASK%s</name>
				<description>I2C Slave address mask register. This mask register is associated with I2ADR0 to determine an address match. The mask register has no effect when comparing to the General Call address (0000000).</description>
				<addressOffset>0x030</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RESERVED</name>
						<description>Reserved. User software should not write ones to reserved bits. This bit reads always back as 0.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>MASK</name>
						<description>Mask bits.</description>
						<bitRange>[7:1]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. User software should not write ones to reserved bits. These bits read always back as 0s.</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
		</registers>
	</peripheral>

	<peripheral>
		<name>WWDT</name>
		<description>Product name title=UM10441 Chapter title=LPC122x Windowed Watchdog Timer (WWDT) Modification date=2/2/2011 Major revision=0 Minor revision=17 </description>
		<groupName>WWDT</groupName>
		<baseAddress>0x40004000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFF</size> 
		<usage>registers</usage> 
		</addressBlock>	
		<interrupt>
			<name>WDT</name>
			<value>22</value>
		</interrupt>
		<registers>
			<register>
				<name>MOD</name>
				<description>Watchdog mode register. This register contains the basic mode and status of the Watchdog Timer.</description>
				<addressOffset>0x000</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000003</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>WDEN</name>
						<description>Watchdog enable bit. The WDEN bit can be locked from subsequent writes by the WDLOCKEN bit.</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>STOPPED</name>
								<description>The watchdog timer is stopped.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RUNNING</name>
								<description>The watchdog timer is running. The watchdog timer is automatically enabled at reset without requiring a valid feed sequence. Any subsequent writes to this bit require a valid feed sequence before the change can take effect.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>WDRESET</name>
						<description>Watchdog reset enable bit. This bit can be changed at any time. The WDRESET bit is set by an external reset or a Watchdog timer reset. The WDRESET bit can be locked from subsequent writes by the WDLOCKEN bit.</description>
						<bitRange>[1:1]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>INTERRUPT</name>
								<description>A watchdog time-out will cause an interrupt.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RESET</name>
								<description>A watchdog timeout will cause a chip reset.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>WDTOF</name>
						<description>Watchdog time-out flag. The Watchdog time-out flag is set when the Watchdog times out, when a feed error occurs, or when WDPROTECT =1 and an attempt is made to write to the WDTC register. This flag is cleared by software writing a 0 to this bit. Causes a chip reset if WDRESET = 1.</description>
						<bitRange>[2:2]</bitRange>
						
					</field>
					<field>
						<name>WDINT</name>
						<description>The Watchdog interrupt flag is set when the Watchdog counter reaches the value specified by WDWARNINT. This flag is cleared when any reset occurs, and is cleared by software by writing a 1 to this bit.</description>
						<bitRange>[3:3]</bitRange>
						
