cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
					</field>
					<field>
						<name>WDPROTECT</name>
						<description>Watchdog update mode. This bit is Set Only. Once the WDPROTECT bit is set it can not be cleared by software. The WDPROTECT bit is cleared by an external reset or a Watchdog timer reset.</description>
						<bitRange>[4:4]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>UNLOCK</name>
								<description>The watchdog timer constant value (WDTC) can be changed at any time.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>LOCK</name>
								<description>The watchdog timer constant value (WDTC) can be changed only after the counter is below the value of WARNINT and WINDOW.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>WDLOCKCLK</name>
						<description>Watchdog clock lock bit.  This bit is cleared on reset and can subsequently be written to only once to set it. Once this bit has been set, it can only be cleared through resetting the chip.</description>
						<bitRange>[5:5]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>THE_WATCHDOG_CLOCK_(</name>
								<description>The watchdog clock (WDCLK) can be disabled at any time.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>SETTING_THIS_BIT_DIS</name>
								<description>Setting this bit disables any writes to the bit or bits that control the power to the currently selected watchdog clock source in the power configuration registers PDRUNCFG, PDSLEEPCFG, and PDAWAKECFG. Other bits in the power configuration registers are not affected. Setting the WDLOCKCLK bit ensures that the WDT always has a valid clock source for WDCLK provided that the watchdog oscillator and/or the IRC are powered.  Before setting the WDLOCKCLK bit, the user must enable either the watchdog oscillator or the IRC or both in all three power configuration registers in order to keep the selected clock source running in Active, Sleep, or Deep-sleep modes. Once the WDLOCKCLK bit is set, the watchdog clock source cannot be switched off or on. If the WDT is to be running in Deep-sleep mode, the watchdog oscillator must be enabled in the PDSLEEPCFG register before setting the WDLOCKCLK bit .</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>WDLOCKDP</name>
						<description>Deep power-down disable bit. This bit is cleared on reset and can subsequently be written to only once to set it. Once this bit has been set, it can only be cleared through resetting the chip.</description>
						<bitRange>[6:6]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DPDEN_UNLOCK</name>
								<description>Deep power-down mode can be entered at any time.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>DPDEN_LOCK</name>
								<description>The DPDEN bit in the PMU (see Table 54 Power control register (PCON, address 0x4003 8000) bit description) cannot be set to 1.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>WDLOCKEN</name>
						<description>Watchdog enable and reset lockout bit. This bit is cleared on reset and can subsequently be written to only once to set it. Once this bit has been set, it can only be cleared through resetting the chip.</description>
						<bitRange>[7:7]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>UNLOCK</name>
								<description>The WDEN and WDRESET bits can be written to by software any time to enable or disable watchdog operation.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>LOCK</name>
								<description>If this bit is set to one, all subsequent writes to the WDEN and WDRESET bits will be blocked. The watchdog will be permanently disabled or enabled depending on the state of the WDEN bit when the WDLOCK bit was set. The reset behavior is affected as follows: If the watchdog is enabled and the WDRESET is bit set to one before setting the WDLOCKEN bit, a watchdog trigger always causes a reset and this behavior cannot be overwritten by software.  If the watchdog is enabled and the WDRESET bit is set to zero before setting the WDLOCKEN bit, a watchdog trigger always causes an interrupt and this behavior cannot be overwritten by software.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:8]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>TC</name>
				<description>Watchdog timer constant register. This register determines the time-out value.</description>
				<addressOffset>0x004</addressOffset>
				<access>read-write</access>
				<resetValue>0x0000FFFF</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>WDTC</name>
						<description>Watchdog time-out interval.</description>
						<bitRange>[23:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:24]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>FEED</name>
				<description>Watchdog feed sequence register. Writing 0xAA followed by 0x55 to this register reloads the Watchdog timer with the value contained in TC.</description>
				<addressOffset>0x008</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>Feed</name>
						<description>Feed value should be 0xAA followed by 0x55.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>TV</name>
				<description>Watchdog timer value register. This register reads out the current value of the Watchdog timer.</description>
				<addressOffset>0x00C</addressOffset>
				<access>read-only</access>
				<resetValue>0xFF</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>Count</name>
						<description>Counter timer value.</description>
						<bitRange>[23:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:24]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>CLKSEL</name>
				<description>Watchdog clock source selection register.</description>
				<addressOffset>0x010</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>WDSEL</name>
						<description>These bits select the clock source for the Watchdog timer as described below. Warning: Improper setting of this value may result in incorrect operation of the Watchdog timer, which could adversely affect system operation. If the WDLOCK bit in this register is set, the WDSEL bits cannot be modified. Writes to the WDSEL bits are ignored if the corresponding clock source is powered down in the PDRUNCFG register (Table 49).</description>
						<bitRange>[1:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>IRC</name>
								<description>Selects the Internal RC oscillator as the Watchdog clock source (default). In active mode only.</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>WDOSC</name>
								<description>Selects the watchdog oscillator as the Watchdog clock source. Must be selected if the WDT is running in Deep-sleep mode.</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RESERVED_DO_NOT_USE</name>
								<description>Reserved. Do not use.</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RESERVED_DO_NOT_USE</name>
								<description>Reserved. Do not use.</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[30:2]</bitRange>
						
