cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
					</field>
					<field>
						<name>WDLOCK</name>
						<description>Lock Watchdog clock source.</description>
						<bitRange>[31:31]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>LOCK</name>
								<description>This bit is set to 0 on any reset. It cannot be cleared by software.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>UNLOCK</name>
								<description>Software can set this bit to 1 at any time. Once WDLOCK is set, the bits of this register cannot be modified.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
				</fields>
			</register>
			<register>
				<name>WARNINT</name>
				<description>Watchdog Warning Interrupt compare value.</description>
				<addressOffset>0x014</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>WARNINT</name>
						<description>Watchdog warning interrupt compare value.</description>
						<bitRange>[9:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:10]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>WINDOW</name>
				<description>Watchdog Window compare value.</description>
				<addressOffset>0x018</addressOffset>
				<access>read-write</access>
				<resetValue>0xFFFFFF</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>WINDOW</name>
						<description>Watchdog window value.</description>
						<bitRange>[23:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:24]</bitRange>
					</field>
				</fields>
			</register>
		</registers>
    </peripheral>
	<peripheral>
		<name>UART0</name>
		<description>Product name title=UM10441 Chapter title=LPC122x UART0 with modem control Modification date=2/2/2011 Major revision=0 Minor revision=17 </description>
		<groupName>UART0</groupName>
		<baseAddress>0x40008000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFF</size> 
		<usage>registers</usage> 
		</addressBlock>	
		<interrupt>
			<name>UART0</name>
			<value>18</value>
		</interrupt>
		<registers>
			<register>
				<name>RBR</name>
				<description>Receiver Buffer Register. Contains the next received character to be read. (DLAB=0)</description>
				<addressOffset>0x000</addressOffset>
				<access>read-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<readAction>modify</readAction>
				<fields>
					<field>
						<name>RBR</name>
						<description>The UART Receiver Buffer Register contains the oldest received byte in the UART RX FIFO.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>THR</name>
				<description>Transmit Holding Register. The next character to be transmitted is written here. (DLAB=0)</description>
				<alternateRegister>RBR</alternateRegister>
				
				<addressOffset>0x000</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>THR</name>
						<description>Writing to the UART Transmit Holding Register causes the data to be stored in the UART transmit FIFO. The byte will be sent when it reaches the bottom of the FIFO and the transmitter is available.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>DLL</name>
				<description>Divisor Latch LSB. Least significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. (DLAB = 1)</description>
				<alternateRegister>RBR</alternateRegister>
				
				<addressOffset>0x000</addressOffset>
				<access>read-write</access>
				<resetValue>0x01</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DLLSB</name>
						<description>The UART Divisor Latch LSB Register, along with the DLM register, determines the baud rate of the UART.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>DLM</name>
				<description>Divisor Latch MSB. Most significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. (DLAB = 1)</description>
				<addressOffset>0x004</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DLMSB</name>
						<description>The UART Divisor Latch MSB Register, along with the DLL register, determines the baud rate of the UART.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>IER</name>
				<description>Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential UART interrupts. (DLAB=0)</description>
				<alternateRegister>DLM</alternateRegister>
				
