cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
					</field>
				</fields>
			</register>
			<register>
				<name>RS485ADRMATCH</name>
				<description>RS-485/EIA-485 address match. Contains the address match value for RS-485/EIA-485 mode.</description>
				<addressOffset>0x050</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>ADRMATCH</name>
						<description>Contains the address match value.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>RS485DLY</name>
				<description>RS-485/EIA-485 direction control delay.</description>
				<addressOffset>0x054</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DLY</name>
						<description>Contains the direction control (RTS or DTR) delay value. This register works in conjunction with an 8-bit counter.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>FIFOLVL</name>
				<description>FIFO Level register. Provides the current fill levels of the transmit and receive FIFOs.</description>
				<addressOffset>0x058</addressOffset>
				<access>read-only</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RXFIFILVL</name>
						<description>Reflects the current level of the UART receiver FIFO. 0 = empty, 0xF = FIFO full.</description>
						<bitRange>[3:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. The value read from a reserved bit is not defined.</description>
						<bitRange>[7:4]</bitRange>
					</field>
					<field>
						<name>TXFIFOLVL</name>
						<description>Reflects the current level of the UART transmitter FIFO. 0 = empty, 0xF = FIFO full.</description>
						<bitRange>[11:8]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:12]</bitRange>
					</field>
				</fields>
			</register>
		</registers>
    </peripheral>
	<peripheral>
		<name>UART1</name>
		<description>Product name title=UM10441 Chapter title=LPC122x UART1 Modification date=2/3/2011 Major revision=0 Minor revision=17 </description>
		<groupName>UART1</groupName>
		<baseAddress>0x4000C000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFF</size> 
		<usage>registers</usage> 
		</addressBlock>	
		<interrupt>
			<name>UART1</name>
			<value>19</value>
		</interrupt>
		<registers>
			<register>
				<name>RBR</name>
				<description>Receiver Buffer Register. Contains the next received character to be read.</description>
				<addressOffset>0x000</addressOffset>
				<access>read-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<readAction>modify</readAction>
				<fields>
					<field>
						<name>RBR</name>
						<description>The UART Receiver Buffer Register contains the oldest received byte in the UART RX FIFO.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>THR</name>
				<description>Transmit Holding Register. The next character to be transmitted is written here.</description>
				<alternateRegister>RBR</alternateRegister>
				
				<addressOffset>0x000</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>THR</name>
						<description>Writing to the UART Transmit Holding Register causes the data to be stored in the UART transmit FIFO. The byte will be sent when it reaches the bottom of the FIFO and the transmitter is available.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>DLL</name>
				<description>Divisor Latch LSB. Least significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider.</description>
				<alternateRegister>RBR</alternateRegister>
				
				<addressOffset>0x000</addressOffset>
				<access>read-write</access>
				<resetValue>0x01</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DLLSB</name>
						<description>The UART Divisor Latch LSB Register, along with the DLM register, determines the baud rate of the UART.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>DLM</name>
				<description>Divisor Latch MSB. Most significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. (DLAB = 1). </description>
				<addressOffset>0x004</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DLMSB</name>
						<description>The UART Divisor Latch MSB Register, along with the DLL register, determines the baud rate of the UART.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>IER</name>
				<description>Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential UART interrupts. (DLAB = 0)</description>
				<alternateRegister>DLM</alternateRegister>
				
