cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
				<addressOffset>0x004</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RBRIE</name>
						<description>RBR Interrupt Enable. Enables the Receive Data Available interrupt for UART. It also controls the Character Receive Time-out interrupt.</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DISABLE</name>
								<description>Disable the RDA interrupts.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ENABLE</name>
								<description>Enable the RDA interrupts.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>THREIE</name>
						<description>THRE Interrupt Enable. Enables the THRE interrupt for UART. The status of this interrupt can be read from LSR[5].</description>
						<bitRange>[1:1]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DISABLE</name>
								<description>Disable the THRE interrupts.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ENABLE</name>
								<description>Enable the THRE interrupts.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RXIE</name>
						<description>RX Line Interrupt Enable. Enables the UART RX line status interrupts. The status of this interrupt can be read from LSR[4:1].</description>
						<bitRange>[2:2]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DISABLE</name>
								<description>Disable the RX line status interrupts.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ENABLE</name>
								<description>Enable the RX line status interrupts.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[3:3]</bitRange>
						
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[6:4]</bitRange>
						
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[7:7]</bitRange>
						
					</field>
					<field>
						<name>ABEOINTEN</name>
						<description>Enables the end of auto-baud interrupt.</description>
						<bitRange>[8:8]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DISABLE</name>
								<description>Disable end of auto-baud Interrupt.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ENABLE</name>
								<description>Enable end of auto-baud Interrupt.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>ABTOINTEN</name>
						<description>Enables the auto-baud time-out interrupt.</description>
						<bitRange>[9:9]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DISABLE</name>
								<description>Disable auto-baud time-out Interrupt.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ENABLE</name>
								<description>Enable auto-baud time-out Interrupt.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:10]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>IIR</name>
				<description>Interrupt ID Register. Identifies which interrupt(s) are pending.</description>
				<addressOffset>0x008</addressOffset>
				<access>read-only</access>
				<resetValue>0x01</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>INTSTATUS</name>
						<description>Interrupt status. Note that IIR[0] is active low. The pending interrupt can be determined by evaluating IIR[3:1].</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>PENDING</name>
								<description>At least one interrupt is pending.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>NO_INTERRUPT_IS_PEND</name>
								<description>No interrupt is pending.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>INTID</name>
						<description>Interrupt identification. IER[3:1] identifies an interrupt corresponding to the UART RX FIFO. All other combinations of IER[3:1] not listed below are reserved (000,100,101,111).</description>
						<bitRange>[3:1]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>RECEIVE_LINE_S</name>
								<description>1   - Receive Line Status (RLS).</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RECEIVE_DATA_AV</name>
								<description>2a - Receive Data Available (RDA).</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>CHARACTER_TIME_</name>
								<description>2b - Character Time-out Indicator (CTI).</description>
								<value>0x6</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>THRE_INTERRUPT</name>
								<description>3   - THRE Interrupt.</description>
								<value>0x1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[5:4]</bitRange>
						
