cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
					</field>
				</fields>
			</register>
			<register>
				<name>FDR</name>
				<description>Fractional Divider Register. Generates a clock input for the baud rate divider.</description>
				<addressOffset>0x028</addressOffset>
				<access>read-write</access>
				<resetValue>0x10</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DIVADDVAL</name>
						<description>Baud-rate generation pre-scaler divisor value. If this field is 0, fractional baud-rate generator will not impact the UARTn baudrate.</description>
						<bitRange>[3:0]</bitRange>
					</field>
					<field>
						<name>MULVAL</name>
						<description>Baud-rate pre-scaler multiplier value. This field must be greater or equal 1 for UARTn to operate properly, regardless of whether the fractional baud-rate generator is used or not.</description>
						<bitRange>[7:4]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>TER</name>
				<description>Transmit Enable Register. Turns off UART transmitter for use with software flow control.</description>
				<addressOffset>0x030</addressOffset>
				<access>read-write</access>
				<resetValue>0x80</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[6:0]</bitRange>
					</field>
					<field>
						<name>TXEN</name>
						<description>When this bit is 1, as it is after a Reset, data written to the THR is output on the TXD pin as soon as any preceding data has been sent. If this bit cleared to 0 while a character is being sent, the transmission of that character is completed, but no further characters are sent until this bit is set again. In other words, a 0 in this bit blocks the transfer of characters from the THR or TX FIFO into the transmit shift register. Software can clear this bit when it receives an XOFF character (DC3). Software can set this bit again when it receives an XON (DC1) character.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>FIFOLVL</name>
				<description>FIFO Level register. Provides the current fill levels of the transmit and receive FIFOs.</description>
				<addressOffset>0x058</addressOffset>
				<access>read-only</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RXFIFILVL</name>
						<description>Reflects the current level of the UART receiver FIFO. 0 = empty, 0xF = FIFO full.</description>
						<bitRange>[3:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. The value read from a reserved bit is not defined.</description>
						<bitRange>[7:4]</bitRange>
					</field>
					<field>
						<name>TXFIFOLVL</name>
						<description>Reflects the current level of the UART transmitter FIFO. 0 = empty, 0xF = FIFO full.</description>
						<bitRange>[11:8]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:12]</bitRange>
					</field>
				</fields>
			</register>
		</registers>
    </peripheral>
	<peripheral>
		<name>CT16B0</name>
		<description>Product name title=UM10441 Chapter title=LPC122x 16-bit Counter/timer 0/1 (CT16B0/1) Modification date=2/3/2011 Major revision=0 Minor revision=17 </description>
		<groupName>CT16B</groupName>
		<baseAddress>0x40010000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFF</size> 
		<usage>registers</usage> 
		</addressBlock>	
		<interrupt>
			<name>CT16B0</name>
			<value>13</value>
		</interrupt>		
		<registers>
			<register>
				<name>IR</name>
				<description>Interrupt Register. The IR can be written to clear interrupts. The IR can be read to identify which of eight possible interrupt sources are pending.</description>
				<addressOffset>0x000</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MR0INT</name>
						<description>Interrupt flag for match channel 0.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>MR1INT</name>
						<description>Interrupt flag for match channel 1.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>MR2INT</name>
						<description>Interrupt flag for match channel 2.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>MR3INT</name>
						<description>Interrupt flag for match channel 3.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CR0INT</name>
						<description>Interrupt flag for capture channel 0 event.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CR1INT</name>
						<description>Interrupt flag for capture channel 1 event.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CR2INT</name>
						<description>Interrupt flag for capture channel 2 event.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>CR3INT</name>
						<description>Interrupt flag for capture channel 3 event.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>TCR</name>
				<description>Timer Control Register. The TCR is used to control the Timer Counter functions. The Timer Counter can be disabled or reset through the TCR.</description>
				<addressOffset>0x004</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CEN</name>
						<description>Counter enable.</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DISABLED</name>
								<description>The counters are disabled.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>COUNTING</name>
								<description>The Timer Counter and Prescale Counter are enabled for counting.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CRST</name>
						<description>Counter reset.</description>
						<bitRange>[1:1]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DO_NOTHING_</name>
								<description>Do nothing.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RESET</name>
								<description>The Timer Counter and the Prescale Counter are synchronously reset on the next positive edge of PCLK. The counters remain reset until TCR[1] is returned to zero.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:2]</bitRange>
						
