cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
					</field>
				</fields>
			</register>
			<register>
				<dim>4</dim>
				<dimIncrement>0x4</dimIncrement>
				<dimIndex>0-3</dimIndex>
				<name>CR%s</name>
				<description>Capture Register. CR is loaded with the value of TC when there is an event on the CT32B_CAP input.</description>
				<addressOffset>0x02C</addressOffset>
				<access>read-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CAP</name>
						<description>Timer counter capture value.</description>
						<bitRange>[31:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>EMR</name>
				<description>External Match Register. The EMR controls the match function and the external match pins CT32Bn_MAT[3:0].</description>
				<addressOffset>0x03C</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>EM0</name>
						<description>External Match 0. This bit reflects the state of output CT32Bn_MAT0, whether or not this output is connected to its pin. When a match occurs between the TC and MR0, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[5:4] control the functionality of this output. This bit is driven to the CT32B0_MAT0/CT32B1_MAT0 pins if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>
						<bitRange>[0:0]</bitRange>
						
					</field>
					<field>
						<name>EM1</name>
						<description>External Match 1. This bit reflects the state of output CT32Bn_MAT1, whether or not this output is connected to its pin. When a match occurs between the TC and MR1, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[7:6] control the functionality of this output. This bit is driven to the CT32B0_MAT1/CT32B1_MAT1 pins if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>
						<bitRange>[1:1]</bitRange>
						
					</field>
					<field>
						<name>EM2</name>
						<description>External Match 2. This bit reflects the state of output CT32Bn_MAT2, whether or not this output is connected to its pin. When a match occurs between the TC and MR2, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[9:8] control the functionality of this output. This bit is driven to the CT32B0_MAT2/CT32B1_MAT2 pins if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>
						<bitRange>[2:2]</bitRange>
						
					</field>
					<field>
						<name>EM3</name>
						<description>External Match 3. This bit reflects the state of output CT32Bn_MAT3, whether or not this output is connected to its pin. When a match occurs between the TC and MR3, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[11:10] control the functionality of this output. This bit is driven to the CT32B3_MAT0/CT32B1_MAT3 pins if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>
						<bitRange>[3:3]</bitRange>
						
					</field>
					<field>
						<name>EMC0</name>
						<description>External Match Control 0. Determines the functionality of External Match 0.</description>
						<bitRange>[5:4]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DO_NOTHING_</name>
								<description>Do Nothing.</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>CLEAR_THE_CORRESPOND</name>
								<description>Clear the corresponding External Match bit/output to 0 (CT32Bi_MAT0 pin is LOW if pinned out).</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>SET_THE_CORRESPONDIN</name>
								<description>Set the corresponding External Match bit/output to 1 (CT32Bi_MAT0 pin is HIGH if pinned out).</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>TOGGLE_THE_CORRESPON</name>
								<description>Toggle the corresponding External Match bit/output.</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>EMC1</name>
						<description>External Match Control 1. Determines the functionality of External Match 1.</description>
						<bitRange>[7:6]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DO_NOTHING_</name>
								<description>Do Nothing.</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>CLEAR_THE_CORRESPOND</name>
								<description>Clear the corresponding External Match bit/output to 0 (CT32Bi_MAT1 pin is LOW if pinned out).</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>SET_THE_CORRESPONDIN</name>
								<description>Set the corresponding External Match bit/output to 1 (CT32Bi_MAT1 pin is HIGH if pinned out).</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>TOGGLE_THE_CORRESPON</name>
								<description>Toggle the corresponding External Match bit/output.</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>EMC2</name>
						<description>External Match Control 2. Determines the functionality of External Match 2.</description>
						<bitRange>[9:8]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DO_NOTHING_</name>
								<description>Do Nothing.</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>CLEAR_THE_CORRESPOND</name>
								<description>Clear the corresponding External Match bit/output to 0 (CT32Bi_MAT2 pin is LOW if pinned out).</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>SET_THE_CORRESPONDIN</name>
								<description>Set the corresponding External Match bit/output to 1 (CT32Bi_MAT2 pin is HIGH if pinned out).</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>TOGGLE_THE_CORRESPON</name>
								<description>Toggle the corresponding External Match bit/output.</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>EMC3</name>
						<description>External Match Control 3. Determines the functionality of External Match 3.</description>
						<bitRange>[11:10]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DO_NOTHING_</name>
								<description>Do Nothing.</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>CLEAR_THE_CORRESPOND</name>
								<description>Clear the corresponding External Match bit/output to 0 (CT32Bi_MAT3 pin is LOW if pinned out).</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>SET_THE_CORRESPONDIN</name>
								<description>Set the corresponding External Match bit/output to 1 (CT32Bi_MAT3 pin is HIGH if pinned out).</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>TOGGLE_THE_CORRESPON</name>
								<description>Toggle the corresponding External Match bit/output.</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:12]</bitRange>
						
