cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
					</field>
				</fields>
			</register>
			<register>
				<name>GDR</name>
				<description>A/D Global Data Register. Contains the result of the most recent A/D conversion.</description>
				<addressOffset>0x004</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RESERVED</name>
						<description>Reserved. These bits always read as zeros.</description>
						<bitRange>[5:0]</bitRange>
					</field>
					<field>
						<name>RESULT</name>
						<description>When DONE is 1, this field contains a binary fraction representing the voltage on the ADn pin selected by the SEL field, divided by the voltage on the VDD(3V3) pin: V/VREF. Zero in the field indicates that the voltage on the ADn pin was less than, equal to, or close to that on VSS, while 0x3FF indicates that the voltage on ADn was close to, equal to, or greater than that on VREF.</description>
						<bitRange>[15:6]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. These bits always read as zeros.</description>
						<bitRange>[23:16]</bitRange>
					</field>
					<field>
						<name>CHN</name>
						<description>These bits contain the channel from which the RESULT bits were converted.</description>
						<bitRange>[26:24]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. These bits always read as zeros.</description>
						<bitRange>[29:27]</bitRange>
					</field>
					<field>
						<name>OVERRUN</name>
						<description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the RESULT bits.</description>
						<bitRange>[30:30]</bitRange>
					</field>
					<field>
						<name>DONE</name>
						<description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read and when the ADCR is written. If the ADCR is written while a conversion is still in progress, this bit is set and a new conversion is started.</description>
						<bitRange>[31:31]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>INTEN</name>
				<description>A/D Interrupt Enable Register. This register contains enable bits that allow the DONE flag of each A/D channel to be included or excluded from contributing to the generation of an A/D interrupt.</description>
				<addressOffset>0x00C</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000100</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>ADINTEN</name>
						<description>These bits allow control over which A/D channels generate interrupts for conversion completion. When bit 0 is one, completion of a conversion on A/D channel 0 will generate an interrupt, when bit 1 is one, completion of a conversion on A/D channel 1 will generate an interrupt, etc.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>ADGINTEN</name>
						<description>When 1, enables the global DONE flag in ADDR to generate an interrupt. When 0, only the individual A/D channels enabled by ADINTEN 7:0 will generate interrupts.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. These bits always read as zeros.</description>
						<bitRange>[31:9]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<dim>8</dim>
				<dimIncrement>0x4</dimIncrement>
				<dimIndex>0-7</dimIndex>
				<name>DR%s</name>
				<description>A/D Channel  Data Register. This register contains the result of the most recent conversion completed on channel.</description>
				<addressOffset>0x010</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000100</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RESERVED</name>
						<description>Reserved. These bits always read as zeros.</description>
						<bitRange>[5:0]</bitRange>
					</field>
					<field>
						<name>RESULT</name>
						<description>When DONE is 1, this field contains a binary fraction representing the voltage on the ADn pin selected by the SEL field, divided by the voltage on the VDD(3V3) pin: V/VREF. Zero in the field indicates that the voltage on the ADn pin was less than, equal to, or close to that on VSSA, while 0x3FF indicates that the voltage on ADn was close to, equal to, or greater than that on VREF.</description>
						<bitRange>[15:6]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. These bits always read as zeros.</description>
						<bitRange>[29:16]</bitRange>
					</field>
					<field>
						<name>OVERRUN</name>
						<description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the RESULT bits.This bit is cleared by reading this register.</description>
						<bitRange>[30:30]</bitRange>
					</field>
					<field>
						<name>DONE</name>
						<description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read.</description>
						<bitRange>[31:31]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>STAT</name>
				<description>A/D Status Register. This register contains DONE and OVERRUN flags for all of the A/D channels, as well as the A/D interrupt flag.</description>
				<addressOffset>0x030</addressOffset>
				<access>read-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DONE</name>
						<description>These bits mirror the DONE status flags that appear in the result register for each A/D channel.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>OVERRUN</name>
						<description>These bits mirror the OVERRRUN status flags that appear in the result register for each A/D channel. Reading ADSTAT allows checking the status of all A/D channels simultaneously.</description>
						<bitRange>[15:8]</bitRange>
					</field>
					<field>
						<name>ADINT</name>
						<description>This bit is the A/D interrupt flag. It is one when any of the individual A/D channel Done flags is asserted and enabled to contribute to the A/D interrupt via the ADINTEN register.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. These bits always read as zeros.</description>
						<bitRange>[31:17]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>TRM</name>
				<description>A/D trim register</description>
				<addressOffset>0x034</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RESERVED</name>
						<description>Reserved. These bits always read as zeros.</description>
						<bitRange>[3:0]</bitRange>
					</field>
					<field>
						<name>ADCOFFS</name>
						<description>Offset trim bits for ADC operation. Initialized by the boot code. Can be overwritten by the user.</description>
						<bitRange>[7:4]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. These bits always read as zeros.</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
