cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
		</registers>
	</peripheral>
	<peripheral>
		<name>PMU</name>
		<description>Product name title=UM10441 Chapter title=LPC122x Power Monitor Unit (PMU) Modification date=2/10/2011 Major revision=0 Minor revision=17 </description>
		<groupName>PMU</groupName>
		<baseAddress>0x40038000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFF</size> 
		<usage>registers</usage> 
		</addressBlock>					
		<registers>
			<register>
				<name>PCON</name>
				<description>Power control register</description>
				<addressOffset>0x000</addressOffset>
				<access>read-write</access>
				<resetValue>0x0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Do not write 1 to this bit.</description>
						<bitRange>[0:0]</bitRange>
						
					</field>
					<field>
						<name>DPDEN</name>
						<description>Deep power-down mode enable</description>
						<bitRange>[1:1]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DEEP_SLEEP</name>
								<description>ARM WFI will enter Sleep or Deep-sleep mode (clock to ARM Cortex-M0 core turned off).</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>DEEP_POWERDOWN</name>
								<description>ARM WFI will enter Deep-power down mode (ARM Cortex-M0 core powered-down) if WDLOCKDP = 0 .</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Do not write ones to this bit.</description>
						<bitRange>[7:2]</bitRange>
						
					</field>
					<field>
						<name>SLEEPFLAG</name>
						<description>Sleep mode flag</description>
						<bitRange>[8:8]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>READ_NO_POWER_DOWN_</name>
								<description>Read: No power-down mode entered. LPC1xxx is in Run mode. Write: No effect.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>CLEAR</name>
								<description>Read: Sleep/Deep-sleep or Deep power-down mode entered. Write: Writing a 1 clears the SLEEPFLAG bit to 0.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Do not write ones to this bit.</description>
						<bitRange>[10:9]</bitRange>
						
					</field>
					<field>
						<name>DPDFLAG</name>
						<description>Deep power-down flag</description>
						<bitRange>[11:11]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>READ_DEEP_POWER_DOW</name>
								<description>Read: Deep power-down mode  not entered. Write: No effect.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>CLEAR</name>
								<description>Read: Deep power-down mode entered. Write: Clear the Deep power-down flag.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Do not write ones to this bit.</description>
						<bitRange>[31:12]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<dim>4</dim>
				<dimIncrement>0x4</dimIncrement>
				<dimIndex>0-3</dimIndex>
				<name>GPREG%s</name>
				<description>General purpose register </description>
				<addressOffset>0x004</addressOffset>
				<access>read-write</access>
				<resetValue>0x0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>GPDATA</name>
						<description>Data retained during Deep power-down mode.</description>
						<bitRange>[31:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>SYSCFG</name>
				<description>System configuration register (RTC clock control and hysteresis of the WAKEUP pin).</description>
				<addressOffset>0x014</addressOffset>
				<access>read-write</access>
				<resetValue>0x0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Do not write ones to this bit.</description>
						<bitRange>[9:0]</bitRange>
						
					</field>
					<field>
						<name>WAKEUPHYS</name>
						<description>WAKEUP pin hysteresis enable</description>
						<bitRange>[10:10]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DISABLED</name>
								<description>Hysteresis for WAKUP pin disabled.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ENABLED</name>
								<description>Hysteresis for WAKEUP pin enabled.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RTCCLK</name>
						<description>RTC clock source select (X = don't care). 0000 = 1 Hz clock 0001 = delayed 1 Hz clock 101X = 1 kHz clock 01XX = RTC PCLK (main clock divided by the RTC clock divider value)</description>
						<bitRange>[14:11]</bitRange>
						
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Do not write ones to this bit.</description>
						<bitRange>[31:15]</bitRange>
						
					</field>
				</fields>
			</register>
		</registers>
	</peripheral>
	<peripheral>
		<name>SSP</name>
		<description>Product name title=UM10441 Chapter title=LPC122x SSP controller Modification date=2/10/2011 Major revision=0 Minor revision=17 </description>
		<groupName>SSP</groupName>
		<baseAddress>0x40040000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFF</size> 
		<usage>registers</usage> 
		</addressBlock>	
		<interrupt>
			<name>SSP</name>
			<value>17</value>
		</interrupt>
		<registers>
			<register>
				<name>CR0</name>
				<description>Control Register 0. Selects the serial clock rate, bus type, and data size.</description>
				<addressOffset>0x000</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DSS</name>
						<description>Data Size Select. This field controls the number of bits transferred in each frame. Values 0000-0010 are not supported and should not be used.</description>
						<bitRange>[3:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>4_BIT_TRANSFER</name>
								<description>4-bit transfer</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>5_BIT_TRANSFER</name>
								<description>5-bit transfer</description>
								<value>0x4</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>6_BIT_TRANSFER</name>
								<description>6-bit transfer</description>
								<value>0x5</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>7_BIT_TRANSFER</name>
								<description>7-bit transfer</description>
								<value>0x6</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>8_BIT_TRANSFER</name>
								<description>8-bit transfer</description>
								<value>0x7</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>9_BIT_TRANSFER</name>
								<description>9-bit transfer</description>
								<value>0x8</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>10_BIT_TRANSFER</name>
								<description>10-bit transfer</description>
								<value>0x9</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>11_BIT_TRANSFER</name>
								<description>11-bit transfer</description>
								<value>0xA</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>12_BIT_TRANSFER</name>
								<description>12-bit transfer</description>
								<value>0xB</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>13_BIT_TRANSFER</name>
								<description>13-bit transfer</description>
								<value>0xC</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>14_BIT_TRANSFER</name>
								<description>14-bit transfer</description>
								<value>0xD</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>15_BIT_TRANSFER</name>
								<description>15-bit transfer</description>
								<value>0xE</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>16_BIT_TRANSFER</name>
								<description>16-bit transfer</description>
								<value>0xF</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>FRF</name>
						<description>Frame Format.</description>
						<bitRange>[5:4]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>SPI</name>
								<description>SPI</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>TI</name>
								<description>TI</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>MICROWIRE</name>
								<description>Microwire</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RESERVED</name>
								<description>This combination is not supported and should not be used.</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CPOL</name>
						<description>Clock Out Polarity. This bit is only used in SPI mode.</description>
						<bitRange>[6:6]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>LOW</name>
								<description>SSP controller maintains the bus clock low between frames.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>HIGH</name>
								<description>SSP controller maintains the bus clock high between frames.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CPHA</name>
						<description>Clock Out Phase. This bit is only used in SPI mode.</description>
						<bitRange>[7:7]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>FIRSTCLOCK</name>
								<description>SSP controller captures serial data on the first clock transition of the frame, that is, the transition away from the inter-frame state of the clock line.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>SECONDCLOCK</name>
								<description>SSP controller captures serial data on the second clock transition of the frame, that is, the transition back to the inter-frame state of the clock line.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>SCR</name>
						<description>Serial Clock Rate. The number of prescaler-output clocks per bit on the bus, minus one. Given that CPSDVSR is the prescale divider, and the APB clock PCLK clocks the prescaler, the bit frequency is PCLK / (CPSDVSR x [SCR+1]).</description>
						<bitRange>[15:8]</bitRange>
						
