cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[10:10]</bitRange>
					
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[11:11]</bitRange>
					
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[14:12]</bitRange>
					
				</field>
				<field>
					<name>COMP_PD</name>
					<description>Comparator power-down</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
					
				</field>
			</fields>
		</register>
		<register>
			<name>DEVICE_ID</name>
			<description>Device ID</description>
			<addressOffset>0x3F4</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>DEVICEID</name>
					<description>Device ID for LPC122x parts: LPC12D27FBD100/301 = 0x3670 002B LPC1227FBD64/301 = 0x3670 002B LPC1227FBD48/301 = 0x3670 002B LPC1226FBD64/301 = 0x3660 002B LPC1226FBD48/301 = 0x3660 002B LPC1225FBD64/321 = 0x3652 002B LPC1225FBD64/301 = 0x3650 002B LPC1225FBD48/321 = 0x3652 002B LPC1225FBD48/301 = 0x3650 002B LPC1224FBD64/121 = 0x3642 C02B LPC1224FBD64/101 = 0x3640 C02B LPC1224FBD48/121 = 0x3642 C02B LPC1224FBD48/101 = 0x3640 C02B</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
	</registers>
</peripheral>

	
	<peripheral>
		<name>MICRO_DMA</name>
		<description>Product name title=UM10441 Chapter title=LPC122x General purpose micro DMA controller Modification date=2/10/2011 Major revision=0 Minor revision=17 </description>
		<groupName>MICRO_DMA</groupName>
		<baseAddress>0x4004C000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFF</size> 
		<usage>registers</usage> 
		</addressBlock>	
		<interrupt>
			<name>DMA</name>
			<value>29</value>
		</interrupt>		
		<registers>
			<register>
				<name>DMA_STATUS</name>
				<description>DMA status register</description>
				<addressOffset>0x000</addressOffset>
				<access>read-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MASTER_EN</name>
						<description>Enable status of the controller: 0 = controller disabled. 1 = controller enabled.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[3:1]</bitRange>
					</field>
					<field>
						<name>STATE</name>
						<description>Current state of the control state machine. State can be one of the following: 0000 = idle 0001 = reading channel controller data 0010 = reading source data end pointer 0011 = reading destination data end pointer 0100 = reading source data 0101 = writing destination data 0110 = waiting for DMA request to clear 0111 = writing channel controller data 1000 = stalled 1001 = done 1010 = peripheral scatter-gather transition  1011-1111 = undefined</description>
						<bitRange>[7:4]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[15:8]</bitRange>
					</field>
					<field>
						<name>CHNLS</name>
						<description>The LPC122x micro DMA controller is configured for 21 channels. Reset value is number of channels - 1.</description>
						<bitRange>[20:16]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:21]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>DMA_CFG</name>
				<description>DMA configuration register</description>
				<addressOffset>0x004</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MASTER_EN</name>
						<description>Enable for the controller:</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DISABLES_THE_CONTROL</name>
								<description>Disables the controller.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ENABLES_THE_CONTROLL</name>
								<description>Enables the controller.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Write as zero.</description>
						<bitRange>[4:1]</bitRange>
						
					</field>
					<field>
						<name>CHNL_PROT_CTRL1</name>
						<description>Channel protection access control:</description>
						<bitRange>[5:5]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>USER_ACCESS</name>
								<description>User access</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>PRIVILEGED_ACCESS</name>
								<description>Privileged access</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CHNL_PROT_CTRL2</name>
						<description>Channel protection buffer control:</description>
						<bitRange>[6:6]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>NON_BUFFERABLE</name>
								<description>Non-bufferable</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>BUFFERABLE</name>
								<description>Bufferable</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Write as zero.</description>
						<bitRange>[31:7]</bitRange>
						
