cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
					</field>
				</fields>
			</register>
			<register>
				<name>CTRL_BASE_PTR</name>
				<description>Channel control base pointer register</description>
				<addressOffset>0x008</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Write as zero.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>CTRL_BASE_PTR</name>
						<description>Pointer to the base address of the primary data structure.</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>ATL_CTRL_BASE_PTR</name>
				<description>Channel alternate control base pointer register</description>
				<addressOffset>0x00C</addressOffset>
				<access>read-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>ALT_CTRL_BASE_PTR</name>
						<description>Base address of the alternate data structure</description>
						<bitRange>[31:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>DMA_WAITONREQ_STATUS</name>
				<description>Channel wait on request status register</description>
				<addressOffset>0x010</addressOffset>
				<access>read-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DMA_WAITONREQ_STATUS0</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS1</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS2</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS3</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS4</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS5</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS6</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS7</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS8</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS9</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS10</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS11</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS12</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS13</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS14</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS15</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS16</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS17</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS18</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS19</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS20</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS21</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:22]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>CHNL_SW_REQUEST</name>
				<description>Channel software request register</description>
				<addressOffset>0x014</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DMA_SW_REQUEST0</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST1</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST2</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST3</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST4</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST5</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST6</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST7</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST8</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST9</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST10</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST11</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST12</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST13</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST14</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST15</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST16</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST17</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST18</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST19</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST20</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST21</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:22]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>CHNL_USEBURST_SET</name>
				<description>Channel useburst set register</description>
				<addressOffset>0x018</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[3:0]</bitRange>
					</field>
					<field>
						<name>DMA_USEBURST_SET4</name>
						<description>Returns the useburst status for channel c (c = 0 to 20) or disables dma_sreq[c] from generating DMA requests. (For channels 4 and 5 only.) Read as: Bit [c] = 0: DMA channel c responds to requests that it receives on dma_req[c] or dma_sreq[c]. The controller performs 2R, or single, bus transfers. Bit [c] = 1: DMA channel c does not respond to requests that it receives on dma_sreq[c]. The controller only responds to dma_req[c] requests and performs 2R transfers. Write as: Bit [c] = 0: No effect. Use the CHNL_USEBURST_CLR register to set bit [c] to 0. Bit [c] = 1: Disables dma_sreq[C] from generating DMA requests. The controller performs 2R transfers.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>DMA_USEBURST_SET5</name>
						<description>Returns the useburst status for channel c (c = 0 to 20) or disables dma_sreq[c] from generating DMA requests. (For channels 4 and 5 only.) Read as: Bit [c] = 0: DMA channel c responds to requests that it receives on dma_req[c] or dma_sreq[c]. The controller performs 2R, or single, bus transfers. Bit [c] = 1: DMA channel c does not respond to requests that it receives on dma_sreq[c]. The controller only responds to dma_req[c] requests and performs 2R transfers. Write as: Bit [c] = 0: No effect. Use the CHNL_USEBURST_CLR register to set bit [c] to 0. Bit [c] = 1: Disables dma_sreq[C] from generating DMA requests. The controller performs 2R transfers.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>CHNL_USEBURST_CLR</name>
				<description>Channel useburst clear register</description>
				<addressOffset>0x01C</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RESERVED</name>
						<description>Set the appropriate bit to enable dma_sreq[c] to generate requests. (For channels 4 and 5 only.) Write as: Bit [c] = 0: No effect. Use the chnl_useburst_set Register to disable dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[3:0]</bitRange>
					</field>
					<field>
						<name>CHNL_USEBURST_CLR4</name>
						<description>Set the appropriate bit to enable dma_sreq[c] to generate requests. (For channels 4 and 5 only.) Write as: Bit [c] = 0: No effect. Use the chnl_useburst_set Register to disable dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CHNL_USEBURST_CLR5</name>
						<description>Set the appropriate bit to enable dma_sreq[c] to generate requests. (For channels 4 and 5 only.) Write as: Bit [c] = 0: No effect. Use the chnl_useburst_set Register to disable dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Set the appropriate bit to enable dma_sreq[c] to generate requests. (For channels 4 and 5 only.) Write as: Bit [c] = 0: No effect. Use the chnl_useburst_set Register to disable dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[31:6]</bitRange>
					</field>

				</fields>
			</register>
