cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
			<register>
				<name>CHNL_REQ_MASK_SET</name>
				<description>Channel request mask set register</description>
				<addressOffset>0x020</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CHNL_REQ_MASK_SET0</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET1</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET2</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET3</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET4</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET5</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET6</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET7</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET8</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET9</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET10</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET11</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET12</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET13</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET14</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET15</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET16</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET17</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET18</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET19</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET20</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_SET21</name>
						<description>Returns the request mask status of dma_req[c] and dma_sreq[c], or disables the corresponding channel from generating DMA requests. Read as: Bit [c] = 0: External requests are enabled for channel c. Bit [c] = 1: External requests are disabled for channel c. Write as: Bit [c] = 0: No effect. Use the CHNL_REQ_MASK_CLR Register to enable DMA requests. Bit [c] = 1: Disables dma_req[c] and dma_sreq[c] from generating DMA requests.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:22]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>CHNL_REQ_MASK_CLR</name>
				<description>Channel request mask clear register</description>
				<addressOffset>0x024</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CHNL_REQ_MASK_CLR0</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR1</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR2</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR3</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR4</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR5</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR6</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR7</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR8</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR9</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR10</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR11</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR12</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR13</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR14</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR15</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR16</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR17</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR18</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR19</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR20</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>CHNL_REQ_MASK_CLR21</name>
						<description>Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req[c] and dma_sreq[c]. Write as: Bit [c] = 0: No effect. Use the chnl_req_mask_set Register to disable dma_req[c] and dma_sreq[c] from generating requests. Bit [c] = 1: Enables dma_req[c] or dma_sreq[c] to generate DMA requests.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:22]</bitRange>
					</field>
				</fields>
			</register>
