cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
			<register>
				<name>CHNL_PRIORITY_SET</name>
				<description>Channel priority set register</description>
				<addressOffset>0x038</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CHNL_PRIORITY_SET0</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET1</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET2</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET3</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET4</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET5</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET6</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET7</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET8</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET9</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET10</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET11</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET12</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET13</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET14</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET15</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET16</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET17</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET18</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET19</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET20</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_SET21</name>
						<description>Returns the channel priority mask status, or sets the channel priority to high. Read as: Bit [c] = 0: DMA channel c is using the default priority level. Bit [c] = 1: DMA channel c is using a high priority level. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_CLR Register to set channel c to the default priority level. Bit [c] = 1: Channel c uses the high priority level.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:22]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>CHNL_PRIORITY_CLR</name>
				<description>Channel priority clear register</description>
				<addressOffset>0x03C</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CHNL_PRIORITY_CLR0</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR1</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR2</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR3</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR4</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR5</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR6</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR7</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR8</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR9</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR10</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR11</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR12</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR13</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR14</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR15</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR16</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR17</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR18</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR19</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR20</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR21</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:22]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>ERR_CLR</name>
				<description>Bus error clear register</description>
				<addressOffset>0x04C</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>ERR_CLR</name>
						<description>Returns the status of dma_error or sets the signal LOW. Read as: 0 = dma_err is LOW. 1 = dma_err is HIGH. Write as: 0 = No effect, status of dma_err is unchanged. 1 = Sets dma_err LOW.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Write as 0.</description>
						<bitRange>[31:1]</bitRange>
					</field>
				</fields>
			</register>
