cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
			<register>
				<name>CHNL_IRQ_STATUS</name>
				<description>Channel DMA interrupt status register</description>
				<addressOffset>0x080</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CHNL_IRQ_STAT0</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT1</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT2</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT3</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT4</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT5</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT6</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT7</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT8</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT9</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT10</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT11</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT12</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT13</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT14</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT15</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT16</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT17</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT18</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT19</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT20</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT21</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:22]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>IRQ_ERR_ENABLE</name>
				<description>DMA error interrupt enable register</description>
				<addressOffset>0x084</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>IRQ_ERR_ENABLE</name>
						<description>Enables the DMA error (dma_error) signal to create an interrupt. Write as: Bit 0 = 0: DMA error interrupt disabled. Bit 0 = 1: DMA error interrupt enabled.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:1]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>CHNL_IRQ_ENABLE</name>
				<description>Channel DMA interrupt enable register</description>
				<addressOffset>0x088</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CHNL_IRQ_ENABLE0</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE1</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE2</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE3</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE4</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE5</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE6</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE7</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE8</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE9</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE10</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE11</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE12</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE13</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE14</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE15</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE16</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE17</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE18</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE19</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE20</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_ENABLE21</name>
						<description>Enables the DMA done (dma_done[c]) signal to create an interrupt. Write as: Bit[c] = 0: DMA done interrupt disabled for channel c. Bit[c] = 1: DMA done interrupt enabled for channel c.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:22]</bitRange>
					</field>
				</fields>
			</register>
