cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
		</registers>
	</peripheral>
	<peripheral>
		<name>ACOMP</name>
		<description>Product name title=UM10441 Chapter title=LPC122x Comparator Modification date=2/11/2011 Major revision=0 Minor revision=17 </description>
		<groupName>ACOMP</groupName>
		<baseAddress>0x40054000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFF</size> 
		<usage>registers</usage> 
		</addressBlock>	
		<interrupt>
			<name>ACOMP</name>
			<value>20</value>
		</interrupt>		
		<registers>
			<register>
				<name>CMP</name>
				<description>Comparator control register</description>
				<addressOffset>0x00</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CMP0_EN</name>
						<description>Comparator 0 enable.</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>COMPARATOR_0_DISABLE</name>
								<description>Comparator 0 disabled.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>COMPARATOR_0_ENABLED</name>
								<description>Comparator 0 enabled.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMP1_EN</name>
						<description>Comparator 1 enable.</description>
						<bitRange>[1:1]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>COMPARATOR_1_DISABLE</name>
								<description>Comparator 1 disabled.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>COMPARATOR_1_ENABLED</name>
								<description>Comparator 1 enabled.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMPIS</name>
						<description>Select interrupt source.</description>
						<bitRange>[2:2]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>EDGE_TRIGGERED_</name>
								<description>Edge triggered.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>LEVEL_TRIGGERED_</name>
								<description>Level triggered.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMPIEV</name>
						<description>Select edge triggered interrupt to be active on either high or low transitions.</description>
						<bitRange>[3:3]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>FALLING</name>
								<description>Interrupt active on falling edges.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RISING</name>
								<description>Interrupt active on rising edges.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMPBE</name>
						<description>Select edge triggered interrupt to be active on both edges.</description>
						<bitRange>[4:4]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>NOTBOTHEDGES</name>
								<description>Interrupt not active on both edges.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>BOTHEDGES</name>
								<description>Interrupt active on both edges.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMPSR</name>
						<description>Select orientation of the two comparators in the relaxation oscillator circuit.</description>
						<bitRange>[5:5]</bitRange>
						
					</field>
					<field>
						<name>CMPSA0</name>
						<description>Select async/sync output of the comparator 0.</description>
						<bitRange>[6:6]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DIRECT</name>
								<description>The comparator output is used directly.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>SYNCH</name>
								<description>The comparator output is synchronized with the bus clock for output to other modules.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMPSA1</name>
						<description>Select async/sync output of the comparator 1.</description>
						<bitRange>[7:7]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DIRECT</name>
								<description>The comparator output is used directly.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>SYNCH</name>
								<description>The comparator output is synchronized with the bus clock for output to other modules.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMP0_VP_CTRL</name>
						<description>Selection of comparator 0, positive voltage (VP) input channel.</description>
						<bitRange>[10:8]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>VOLTAGE_LADDER_OUTPU</name>
								<description>Voltage ladder output</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I0</name>
								<description>ACMP0_I0</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I1</name>
								<description>ACMP0_I1</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I2</name>
								<description>ACMP0_I2</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I3</name>
								<description>ACMP0_I3</description>
								<value>0x4</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I0</name>
								<description>ACMP1_I0</description>
								<value>0x5</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I1</name>
								<description>ACMP1_I1</description>
								<value>0x6</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>BOD_0_9_V_BAND_GAP</name>
								<description>BOD 0.9 V band gap</description>
								<value>0x7</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMP0_VM_CTRL</name>
						<description>Selection of comparator 0, negative voltage (VM) input channel.</description>
						<bitRange>[13:11]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>VOLTAGE_LADDER_OUTPU</name>
								<description>Voltage ladder output</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I0</name>
								<description>ACMP0_I0</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I1</name>
								<description>ACMP0_I1</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I2</name>
								<description>ACMP0_I2</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I3</name>
								<description>ACMP0_I3</description>
								<value>0x4</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I0</name>
								<description>ACMP1_I0</description>
								<value>0x5</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I1</name>
								<description>ACMP1_I1</description>
								<value>0x6</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>BOD_0_9_V_BAND_GAP</name>
								<description>BOD 0.9 V band gap</description>
								<value>0x7</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMP1_VP_CTRL</name>
						<description>Selection of comparator 1, positive voltage (VP) input channel.</description>
						<bitRange>[16:14]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>VOLTAGE_LADDER_OUTPU</name>
								<description>Voltage ladder output</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I0</name>
								<description>ACMP1_I0</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I1</name>
								<description>ACMP1_I1</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I2</name>
								<description>ACMP1_I2</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I3</name>
								<description>ACMP1_I3</description>
								<value>0x4</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I0</name>
								<description>ACMP0_I0</description>
								<value>0x5</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I1</name>
								<description>ACMP0_I1</description>
								<value>0x6</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>BOD_0_9_V_BAND_GAP</name>
								<description>BOD 0.9 V band gap</description>
								<value>0x7</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMP1_VM_CTRL</name>
						<description>Selection of comparator 1, negative voltage (VM) input channel.</description>
						<bitRange>[19:17]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>VOLTAGE_LADDER_OUTPU</name>
								<description>Voltage ladder output</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I0</name>
								<description>ACMP1_I0</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I1</name>
								<description>ACMP1_I1</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I2</name>
								<description>ACMP1_I2</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I3</name>
								<description>ACMP1_I3</description>
								<value>0x4</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I0</name>
								<description>ACMP0_I0</description>
								<value>0x5</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I1</name>
								<description>ACMP0_I1</description>
								<value>0x6</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>BOD_0_9_V_BAND_GAP</name>
								<description>BOD 0.9 V band gap</description>
								<value>0x7</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>INTCLR</name>
						<description>Interrupt clear bit. Setting this bit to one clears the comparator interrupt.</description>
						<bitRange>[20:20]</bitRange>
						
