cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
			<register>
				<name>OUT</name>
				<description>Pin output value register.</description>
				<addressOffset>0x008</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>OUT0</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>OUT1</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>OUT2</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>OUT3</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>OUT4</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>OUT5</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>OUT6</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>OUT7</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>OUT8</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>OUT9</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>OUT10</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>OUT11</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>OUT12</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>OUT13</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>OUT14</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>OUT15</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>OUT16</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>OUT17</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>OUT18</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>OUT19</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>OUT20</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>OUT21</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>OUT22</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[22:22]</bitRange>
					</field>
					<field>
						<name>OUT23</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[23:23]</bitRange>
					</field>
					<field>
						<name>OUT24</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[24:24]</bitRange>
					</field>
					<field>
						<name>OUT25</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[25:25]</bitRange>
					</field>
					<field>
						<name>OUT26</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[26:26]</bitRange>
					</field>
					<field>
						<name>OUT27</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[27:27]</bitRange>
					</field>
					<field>
						<name>OUT28</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[28:28]</bitRange>
					</field>
					<field>
						<name>OUT29</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[29:29]</bitRange>
					</field>
					<field>
						<name>OUT30</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[30:30]</bitRange>
					</field>
					<field>
						<name>OUT31</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[31:31]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>SET</name>
				<description>Pin output value set register.</description>
				<addressOffset>0x00C</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>SET0</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>SET1</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>SET2</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>SET3</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>SET4</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>SET5</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>SET6</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>SET7</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>SET8</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>SET9</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>SET10</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>SET11</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>SET12</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>SET13</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>SET14</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>SET15</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>SET16</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>SET17</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>SET18</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>SET19</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>SET20</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>SET21</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>SET22</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[22:22]</bitRange>
					</field>
					<field>
						<name>SET23</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[23:23]</bitRange>
					</field>
					<field>
						<name>SET24</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[24:24]</bitRange>
					</field>
					<field>
						<name>SET25</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[25:25]</bitRange>
					</field>
					<field>
						<name>SET26</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[26:26]</bitRange>
					</field>
					<field>
						<name>SET27</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[27:27]</bitRange>
					</field>
					<field>
						<name>SET28</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[28:28]</bitRange>
					</field>
					<field>
						<name>SET29</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[29:29]</bitRange>
					</field>
					<field>
						<name>SET30</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[30:30]</bitRange>
					</field>
					<field>
						<name>SET31</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[31:31]</bitRange>
					</field>
				</fields>
			</register>
