cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
			<register>
				<name>DIR</name>
				<description>Data direction register.</description>
				<addressOffset>0x020</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>IO0</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>IO1</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>IO2</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>IO3</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>IO4</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>IO5</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>IO6</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>IO7</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>IO8</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>IO9</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>IO10</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>IO11</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>IO12</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>IO13</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>IO14</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>IO15</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>IO16</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>IO17</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>IO18</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>IO19</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>IO20</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>IO21</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>IO22</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[22:22]</bitRange>
					</field>
					<field>
						<name>IO23</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[23:23]</bitRange>
					</field>
					<field>
						<name>IO24</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[24:24]</bitRange>
					</field>
					<field>
						<name>IO25</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[25:25]</bitRange>
					</field>
					<field>
						<name>IO26</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[26:26]</bitRange>
					</field>
					<field>
						<name>IO27</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[27:27]</bitRange>
					</field>
					<field>
						<name>IO28</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[28:28]</bitRange>
					</field>
					<field>
						<name>IO29</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[29:29]</bitRange>
					</field>
					<field>
						<name>IO30</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[30:30]</bitRange>
					</field>
					<field>
						<name>IO31</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[31:31]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>IS</name>
				<description>Interrupt sense register.</description>
				<addressOffset>0x024</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>ISENSE0</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>ISENSE1</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>ISENSE2</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>ISENSE3</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>ISENSE4</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>ISENSE5</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>ISENSE6</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>ISENSE7</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>ISENSE8</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>ISENSE9</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>ISENSE10</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>ISENSE11</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>ISENSE12</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>ISENSE13</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>ISENSE14</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>ISENSE15</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>ISENSE16</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>ISENSE17</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>ISENSE18</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>ISENSE19</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>ISENSE20</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>ISENSE21</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>ISENSE22</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[22:22]</bitRange>
					</field>
					<field>
						<name>ISENSE23</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[23:23]</bitRange>
					</field>
					<field>
						<name>ISENSE24</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[24:24]</bitRange>
					</field>
					<field>
						<name>ISENSE25</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[25:25]</bitRange>
					</field>
					<field>
						<name>ISENSE26</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[26:26]</bitRange>
					</field>
					<field>
						<name>ISENSE27</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[27:27]</bitRange>
					</field>
					<field>
						<name>ISENSE28</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[28:28]</bitRange>
					</field>
					<field>
						<name>ISENSE29</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[29:29]</bitRange>
					</field>
					<field>
						<name>ISENSE30</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[30:30]</bitRange>
					</field>
					<field>
						<name>ISENSE31</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[31:31]</bitRange>
					</field>
				</fields>
			</register>
