cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
			<register>
				<name>IBE</name>
				<description>Interrupt both edges register.</description>
				<addressOffset>0x028</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>IBE0</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>IBE1</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>IBE2</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>IBE3</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>IBE4</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>IBE5</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>IBE6</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>IBE7</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>IBE8</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>IBE9</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>IBE10</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>IBE11</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>IBE12</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>IBE13</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>IBE14</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>IBE15</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>IBE16</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>IBE17</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>IBE18</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>IBE19</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>IBE20</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>IBE21</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>IBE22</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[22:22]</bitRange>
					</field>
					<field>
						<name>IBE23</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[23:23]</bitRange>
					</field>
					<field>
						<name>IBE24</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[24:24]</bitRange>
					</field>
					<field>
						<name>IBE25</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[25:25]</bitRange>
					</field>
					<field>
						<name>IBE26</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[26:26]</bitRange>
					</field>
					<field>
						<name>IBE27</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[27:27]</bitRange>
					</field>
					<field>
						<name>IBE28</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[28:28]</bitRange>
					</field>
					<field>
						<name>IBE29</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[29:29]</bitRange>
					</field>
					<field>
						<name>IBE30</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[30:30]</bitRange>
					</field>
					<field>
						<name>IBE31</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[31:31]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>IEV</name>
				<description>Interrupt event register.</description>
				<addressOffset>0x02C</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>IEV0</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>IEV1</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>IEV2</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>IEV3</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>IEV4</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>IEV5</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>IEV6</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>IEV7</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>IEV8</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>IEV9</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>IEV10</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>IEV11</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>IEV12</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>IEV13</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>IEV14</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>IEV15</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>IEV16</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>IEV17</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>IEV18</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>IEV19</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>IEV20</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>IEV21</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>IEV22</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[22:22]</bitRange>
					</field>
					<field>
						<name>IEV23</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[23:23]</bitRange>
					</field>
					<field>
						<name>IEV24</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[24:24]</bitRange>
					</field>
					<field>
						<name>IEV25</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[25:25]</bitRange>
					</field>
					<field>
						<name>IEV26</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[26:26]</bitRange>
					</field>
					<field>
						<name>IEV27</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[27:27]</bitRange>
					</field>
					<field>
						<name>IEV28</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[28:28]</bitRange>
					</field>
					<field>
						<name>IEV29</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[29:29]</bitRange>
					</field>
					<field>
						<name>IEV30</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[30:30]</bitRange>
					</field>
					<field>
						<name>IEV31</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[31:31]</bitRange>
					</field>
				</fields>
			</register>
