cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
			<register>
				<name>IE</name>
				<description>Interrupt mask register.</description>
				<addressOffset>0x030</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MASK0</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>MASK1</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>MASK2</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>MASK3</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>MASK4</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>MASK5</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>MASK6</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>RIS</name>
				<description>Raw interrupt status register.</description>
				<addressOffset>0x034</addressOffset>
				<access>read-only</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RAWST0</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RAWST1</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RAWST2</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RAWST3</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RAWST4</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RAWST5</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RAWST6</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>MIS</name>
				<description>Masked interrupt status register.</description>
				<addressOffset>0x038</addressOffset>
				<access>read-only</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MASK0</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>MASK1</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>MASK2</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>MASK3</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>MASK4</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>MASK5</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>MASK6</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>IC</name>
				<description>Interrupt clear register.</description>
				<addressOffset>0x03C</addressOffset>
				<access>write-only</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CLR0</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>CLR1</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>CLR2</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CLR3</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CLR4</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CLR5</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CLR6</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
