cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
		</registers>
    </peripheral>
	<peripheral>
		<name>GPIO2</name>
		<description>Product name title=UM10441 Chapter title=LPC122x General Purpose I/O (GPIO) Modification date=2/11/2011 Major revision=0 Minor revision=17 </description>
		<groupName>GPIO2</groupName>
		<baseAddress>0x50020000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFFF</size> 
		<usage>registers</usage> 
		</addressBlock>
		<interrupt>
			<name>PIO2</name>
			<value>27</value>
		</interrupt>
		<registers>
			<register>
				<name>MASK</name>
				<description>Pin value mask register. Affects operations on PIN, OUT, SET, CLR, and NOT registers.</description>
				<addressOffset>0x000</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MASK0</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>MASK1</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>MASK2</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>MASK3</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>MASK4</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>MASK5</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>MASK6</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>MASK7</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>MASK8</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>MASK9</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>MASK10</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>MASK11</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>MASK12</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>MASK13</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>MASK14</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>MASK15</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>PIN</name>
				<description>Pin value register.</description>
				<addressOffset>0x004</addressOffset>
				<access>read-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>PIN0</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>PIN1</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>PIN2</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>PIN3</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>PIN4</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>PIN5</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>PIN6</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>PIN7</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>PIN8</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>PIN9</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>PIN10</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>PIN11</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>PIN12</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>PIN13</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>PIN14</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>PIN15</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>OUT</name>
				<description>Pin output value register.</description>
				<addressOffset>0x008</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>OUT0</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>OUT1</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>OUT2</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>OUT3</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>OUT4</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>OUT5</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>OUT6</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>OUT7</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>OUT8</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>OUT9</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>OUT10</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>OUT11</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>OUT12</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>OUT13</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>OUT14</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>OUT15</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>SET</name>
				<description>Pin output value set register.</description>
				<addressOffset>0x00C</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>SET0</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>SET1</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>SET2</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>SET3</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>SET4</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>SET5</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>SET6</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>SET7</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>SET8</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>SET9</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>SET10</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>SET11</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>SET12</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>SET13</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>SET14</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>SET15</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>CLR</name>
				<description>Pin output value clear register.</description>
				<addressOffset>0x010</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CLEAR0</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>CLEAR1</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>CLEAR2</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CLEAR3</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CLEAR4</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CLEAR5</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CLEAR6</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>CLEAR7</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>CLEAR8</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>CLEAR9</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>CLEAR10</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>CLEAR11</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>CLEAR12</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>CLEAR13</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>CLEAR14</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>CLEAR15</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
