cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
			<register>
				<name>IEV</name>
				<description>Interrupt event register.</description>
				<addressOffset>0x02C</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>IEV0</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>IEV1</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>IEV2</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>IEV3</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>IEV4</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>IEV5</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>IEV6</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>IEV7</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>IEV8</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>IEV9</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>IEV10</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>IEV11</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>IEV12</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>IEV13</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>IEV14</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>IEV15</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>IE</name>
				<description>Interrupt mask register.</description>
				<addressOffset>0x030</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MASK0</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>MASK1</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>MASK2</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>MASK3</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>MASK4</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>MASK5</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>MASK6</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>MASK7</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>MASK8</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>MASK9</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>MASK10</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>MASK11</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>MASK12</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>MASK13</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>MASK14</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>MASK15</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>RIS</name>
				<description>Raw interrupt status register.</description>
				<addressOffset>0x034</addressOffset>
				<access>read-only</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RAWST0</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RAWST1</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RAWST2</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RAWST3</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RAWST4</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RAWST5</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RAWST6</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RAWST7</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>RAWST8</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>RAWST9</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>RAWST10</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>RAWST11</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>RAWST12</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>RAWST13</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>RAWST14</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>RAWST15</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>MIS</name>
				<description>Masked interrupt status register.</description>
				<addressOffset>0x038</addressOffset>
				<access>read-only</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MASK0</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>MASK1</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>MASK2</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>MASK3</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>MASK4</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>MASK5</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>MASK6</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>MASK7</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>MASK8</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>MASK9</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>MASK10</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>MASK11</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>MASK12</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>MASK13</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>MASK14</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>MASK15</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
