cmsis-svd/cmsis-svd/data/NXP/LPC122x.svd
			<register>
				<name>IC</name>
				<description>Interrupt clear register.</description>
				<addressOffset>0x03C</addressOffset>
				<access>write-only</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CLR0</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>CLR1</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>CLR2</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CLR3</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CLR4</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CLR5</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CLR6</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>CLR7</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>CLR8</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>CLR9</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>CLR10</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>CLR11</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>CLR12</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>CLR13</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>CLR14</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>CLR15</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
		</registers>
    </peripheral>
	<peripheral>
		<name>FLASHCTRL</name>
		<description>Product name title=UM10441 Chapter title=LPC122x System control (SYSCON) Modification date=2/16/2011 Major revision=1 Minor revision=0 </description>
		<groupName>FLASHCTRL</groupName>
		<baseAddress>0x50060000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFF</size> 
		<usage>registers</usage> 
		</addressBlock>					
		<registers>
			<register>
				<name>FLASHCFG</name>
				<description>Flash read cycle configuration</description>
				<addressOffset>0x028</addressOffset>
				<access>read-write</access>
				
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RDCFG</name>
						<description>Flash memory read access time</description>
						<bitRange>[1:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>2CYCLES</name>
								<description>2 system clock cycles flash access time</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>3CYCLES</name>
								<description>3 system clock cycles flash access time</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>4CYCLES</name>
								<description>4 system clock cycles flash access time</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>5CYCLES</name>
								<description>5 system clock cycles flash access time</description>
								<value>0x3</value>
							</enumeratedValue>							
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:2]</bitRange>
						
